The curve lying in the geometrical center of the element.
  Namespace:   Autodesk.Revit.DB.Structure.StructuralSections
  Assembly:   RevitAPI  (in RevitAPI.dll) Version: 18.0.0.0 (18.0.0.420)
  Since:  2018
 Syntax
  C#
public Curve CenterCurve { get; }
  Visual Basic
Public ReadOnly Property CenterCurve As Curve
	Get
  Visual C++
public:
property Curve^ CenterCurve {
	Curve^ get ();
}
 See Also
  StructuralElementDefinitionData Class
  Autodesk.Revit.DB.Structure.StructuralSections Namespace